doomemacs/.doom.d/config.org
#+TITLE: Config
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el :mkdirp yes

* Startup Performance
Make startup faster.

#+begin_src emacs-lisp
(setq gc-cons-threshold 100000000)

(setq read-process-output-max (* 1024 1024)) ;; 1mb

(setq lsp-log-io nil)
#+end_src

* Window Management
** EXWM setup
Defunct now, I don't really use it.
*** Utility functions

#+begin_src emacs-lisp
;; (defun alm/exwm-update-class ()
;;   (exwm-workspace-rename-buffer exwm-class-name))

;; (defun alm/everywhere()
;;   (interactive)
;;   (start-process-shell-command
;;    "bash" nil "doom nowhere"))

;; (defun alm/connect-to-nextcloud()
;;   (start-process-shell-command
;;    "bash" nil "mount ~/nextcloud 1>/dev/null"))

;; (defun alm/reboot()
;;   (interactive)
;;   (start-process-shell-command
;;    "bash" nil "reboot"))

;; (defun alm/kill-and-close ()
;;   (interactive)
;;   "Kill a buffer, and if possible, close it's window."
;;    (kill-current-buffer)
;;    (delete-window))

;; (defun alm/exwm-update-title ()
;;   (pcase exwm-class-name
;;     ("Brave-browser" (exwm-workspace-rename-buffer (format "Brave: %s" exwm-title)))))

;;   ;; When window title updates, use it to set the buffer name
;;   (add-hook 'exwm-update-title-hook #'alm/exwm-update-title)

;; (defun alm/set-chosen-wallpaper(wallpaper-file)
;;   (start-process-shell-command
;;    "feh" nil (concat "feh --bg-scale " wallpaper-file)))

;; (defun alm/set-random-wallpaper()
;;   (interactive)
;;   (let* ((pictures (directory-files "~/.lightdm_images" t directory-files-no-dot-files-regexp)))
;;    (alm/set-chosen-wallpaper (nth (random (length pictures)) pictures))))

;; (defun alm/choose-wallpaper(wallpaper-file)
;;   "Choose a wallpaper."
;;   (interactive (list(read-file-name "Select wallpaper :" "~/.lightdm_images/")))
;;   (alm/set-chosen-wallpaper wallpaper-file))

;; (defun alm/set-wallpaper()
;;   (interactive)
;;   (start-process-shell-command
;;    "feh" nil "feh --bg-scale /home/hrothgar32/.lightdm_images/futuristic.jpg"))

;; (defun alm/lock-screen()
;;   (interactive)
;;   (start-process-shell-command
;;   "i3lock-fancy" "*i3lock*" "i3lock-fancy -n"))

;; (defun alm/spotify-toggle()
;;   (interactive)
;;   (start-process-shell-command
;;    "playerctl" nil "playerctl --player=spotify play-pause"))

;; (defun alm/spotify-previous()
;;   (interactive)
;;   (start-process-shell-command
;;    "playerctl" nil "playerctl --player=spotify previous"))

;; (defun alm/spotify-next()
;;   (interactive)
;;   (start-process-shell-command
;;    "playerctl" nil "playerctl --player=spotify next"))

;; (defun alm/exwm-init-hook ()
;;   (alm/start-panel)
;;   (alm/set-chosen-wallpaper "~/.lightdm_images/vhs_neon.png"))

;; (add-hook 'exwm-update-class-hook #'alm/exwm-update-class)
;; (add-hook 'exwm-init-hook #'alm/exwm-init-hook)
#+end_src

*** Make screenshot

#+begin_src emacs-lisp
;; (defun alm/make-screenshot(picture-dir picture-name)
;;   (interactive (list (read-directory-name "Select image directory: ")
;;                      (read-string "Image name: ")))
;;   (let* ((image-absolute-path (concat picture-dir picture-name))
;;          (shell-string (concat "scrot -s -e 'mv $f " image-absolute-path "'")))
;;     (start-process-shell-command
;;      "scrot" nil shell-string)))
#+end_src

*** Mappings
#+begin_src emacs-lisp
;; (map! :leader "d w" 'alm/choose-wallpaper)
;; (map! :leader "d r" 'alm/set-random-wallpaper)
;; (map! :leader "r r" 'alm/reboot)
(map! :nv "g z e" 'mc/mark-more-like-this-extended)
#+end_src

* Random functions
   #+begin_src emacs-lisp
      (defun alm/rg-in-dir(initial-dir)
        (interactive (read-directory-name "Select directory for search:"))
        (counsel-rg "" initial-dir))
    (map! :leader "]" 'alm/rg-in-dir)
   #+end_src

* Doom functions

#+begin_src emacs-lisp
(defun doom/ediff-init-and-example ()
  "ediff the current `init.el' with the example in doom-emacs-dir"
  (interactive)
  (ediff-files (concat doom-private-dir "init.el")
               (concat doom-emacs-dir "templates/init.example.el")))

(define-key! help-map
  "di"   #'doom/ediff-init-and-example
  )
#+end_src

* Desktop Environment
** Desktop Key Bindings

#+begin_src emacs-lisp
;; (use-package desktop-environment
;;   :after exwm
;;   :config (desktop-environment-mode)
;;   :custom
;;   (desktop-environment-brightness-small-increment "2%+")
;;   (desktop-environment-brightness-small-decrement "2%-")
;;   (desktop-environment-brightness-normal-increment "5%+")
;;   (desktop-environment-brightness-normal-decrement "5%-"))
#+end_src

** Desktop file

#+begin_src shell :tangle ./exwm/exwm.desktop :mkdirp yes
[Desktop Entry]
Name=EXWM
Comment=Emacs Window Manager
Exec=sh ~/.doom.d/exwm/start-exwm.sh
TryExec=sh
Type=Application
X-LightDM-DesktopName=EXWM
DesktopNames=EXWM
#+end_src

** Launcher Script

This launcher script is invoked by =EXWM.desktop= to start Emacs and load our desktop environment configuration.  We also start up some other helpful applications to configure the desktop experience.

#+begin_src shell :tangle ./exwm/start-exwm.sh :shebang #!/bin/sh

  # Set the screen DPI (uncomment this if needed!)
  # xrdb ~/.emacs.d/exwm/Xresources

  # Run the menet compositor
  picom -b &

  # Enable screen locking on suspend
  # xss-lock -- slock &

  # Fire it up
  # exec dbus-launch --exit-with-session emacs -mm -l ~/.doom.d/desktop.el
  exec emacs -mm
#+end_src

* Structure Templates

#+begin_src emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cpp" . "src C++"))
(add-to-list 'org-structure-template-alist '("js" . "src js"))
#+end_src

* Set spellchecking
** Hungarian

#+begin_src emacs-lisp
(defun alm/set-dictionary-to-hungarian ()
  (interactive)
  (flyspell-mode-off)
  (ispell-change-dictionary "hu_HU")
  (flyspell-mode))

(map! :leader "d h" 'alm/set-dictionary-to-hungarian)
#+end_src

** English

#+begin_src emacs-lisp
(defun alm/set-dictionary-to-english()
  (interactive)
  (flyspell-mode-off)
  (ispell-change-dictionary "en_US")
  (flyspell-mode))

(map! :leader "d e" 'alm/set-dictionary-to-english)
#+end_src

* Set name

#+begin_src emacs-lisp
(setq user-full-name "Álmos-Ágoston Zediu")
#+end_src

* General fixes
** Keybinds

#+begin_src emacs-lisp
(map! "C-i" 'evil-jump-forward)
(setq-default tab-width 4)

(map! :map makefile-mode-map
      "." 'better-jumper-jump-forward)
(map! :leader "[" 'counsel-fzf)
(map! :leader "=" 'counsel-rg)
#+end_src

** Native compilation

#+begin_src emacs-lisp
(setq package-native-compile t)
#+end_src

** Override keymaps

#+begin_src emacs-lisp
(require 'bind-key)
(bind-key* "s-l" 'windmove-right)
(use-package! counsel
  :defer t
  :init
  (define-key!
    [remap projectile-compile-project] #'projectile-compile-project))
#+end_src

** Hl-line mode

#+begin_src emacs-lisp
(global-hl-line-mode)
#+end_src

** Reload Emacs Config

#+begin_src emacs-lisp
(defun alm/reload-emacs-config ()
"It relods my config."
(interactive)
  (load "~/.doom.d/config.el"))

(map! :leader "h r c" 'alm/reload-emacs-config)
#+end_src

** Center Buffers

#+begin_src emacs-lisp
(defun alm/visual-fill()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t
        display-line-numbers nil)
  (visual-fill-column-mode 1))

(add-hook 'dired-mode-hook #'alm/visual-fill)
#+end_src

** Scale text

#+begin_src emacs-lisp
(defun alm/scale-text ()
  (text-scale-increase 1))

(add-hook 'dired-mode-hook #'alm/scale-text)
#+end_src

** Auto-switch to split windows

#+begin_src emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+end_src

** Workspace auto-switching

#+begin_src emacs-lisp
(setq +workspaces-on-switch-project-behavior t)
#+end_src

* Theme Configuration
**  Dark/light mode

#+begin_src emacs-lisp
(defun load-dark-mode ()
  "It loads my dark configuration."
        (interactive)
        (load-theme 'doom-gruvbox t))

(defun load-light-mode ()
  "It loads my light configuration."
        (interactive)
        (load-theme 'spacemacs-light t))
#+end_src

**  Transparency functions
#+begin_src emacs-lisp
(defun alm/disable-transparency ()
  (interactive)
  "It disables transparency."
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
)

(defun alm/enable-transparency ()
  (interactive)
  "It enables transparency"
  (interactive)
  (set-frame-parameter (selected-frame) 'alpha '(89 . 75))
)
#+end_src

** Key bindings

#+begin_src emacs-lisp
(map! :leader "t m d" 'load-dark-mode)
(map! :leader "t m l" 'load-light-mode)
(map! :leader "t t e" 'alm/enable-transparency)
(map! :leader "t t d" 'alm/disable-transparency)
#+end_src

** Startup theme

#+begin_src emacs-lisp
(setq dashboard-startup-banner "~/dotfiles/gnu.png")
(load-dark-mode)
#+end_src

