doomemacs/.doom.d/config.org
* Popup configuration

#+begin_src emacs-lisp
(set-popup-rule! "^/*vterminal*/*$")
;; (defun terminal ()
;; "Initialize or toggle terminal emulator
;; If the terminal window is visible hide it.
;; If a terminal buffer exists, but is not visible, show it.
;; If no terminal buffer exists for the current frame create and show it."
;; (interactive)
;; (multi-vterm-dedicated-toggle)
;; (evil-window-decrease-height 18))
(map! :leader "j" #'multi-vterm-next)
(map! :leader "k" #'multi-vterm-prev)
#+end_src

* Projectile Setup

#+begin_src emacs-lisp
(setq projectile-auto-discover nil)
#+end_src

* DAP Setup

#+begin_src emacs-lisp
(use-package dap-mode
  :custom
  (dap-auto-configure-features '(locals controls))
  (dap-auto-show-output t))

(map! :leader "c h" 'dap-hydra)
#+end_src

* Python setup

#+begin_src emacs-lisp
(use-package! python-black
  :after python)
(add-hook 'python-mode-hook 'python-black-on-save-mode)
(add-hook 'python-mode-hook #'lsp) ; or lsp-deferred
(require 'dap-python)
(setq dap-python-debugger 'debugpy)
#+end_src

* JS Setup

#+begin_src emacs-lisp
(add-hook 'js2-mode-hook 'lsp)
(require 'dap-node)
#+end_src
* Clojure setup

#+begin_src emacs-lisp
(use-package! paredit
  :after clojure-mode)
(use-package! cider
  :after clojure-mode
  :config
  (set-lookup-handlers! 'cider-mode nil)
  )

(setq cider-merge-sessions 'project)

(add-hook 'clojure-mode-hook 'paredit-mode)

(use-package! clj-refactor
  :after clojure-mode
  :config
  (set-lookup-handlers! 'clj-refactor-mode nil))

(require 'clj-deps-new)
(setq cider-edit-jack-in-command t)
#+end_src

* Treemacs setup

#+begin_src emacs-lisp
(require 'treemacs)
(map! :leader "x" 'treemacs)
#+end_src

* Webmode Setup

#+begin_src emacs-lisp
(defun alm/web-mode-hook ()
 (setq web-mode-code-indent-offset 2))

(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
(setq web-mode-engines-alist
      '(("php"    . "\\.phtml\\'")
        ("blade"  . "\\.blade\\.")
        ("django"   . "\\.html\\."))
)
(setq web-mode-enable-engine-detection t)
(setq web-mode-code-indent-offset 2)
(add-hook 'web-mode-hook 'alm/web-mode-hook)
#+end_src

* Org Mode
** General settings

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
(add-hook 'org-mode-hook 'variable-pitch-mode)
(add-hook 'org-mode-hook 'org-bullets-mode)
(add-hook 'org-mode-hook 'menu-bar--display-line-numbers-mode-none)
(add-hook 'org-mode-hook 'writeroom-mode)

(setq org-directory "~/Org/")
(setq org-hide-block-startup t)
(setq org-bullets-bullet-list '(" "))
(setq org-startup-with-latex-preview t)
(setq org-startup-with-inline-images t)
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))
(with-eval-after-load 'ox
  (require 'ox-hugo))
(setq org-priority-faces '((65: foreground-color "#660000")
                           (66: foreground-color "#99FFFF")
                           (67: foreground-color "#009150")))
(use-package! org-fancy-priorities
  :hook (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕"))
  )
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

** Automatic tangling
This snippet adds a hook to a =org-mode= buffer so that the config file gets
executed each time such a buffer gets saved.

#+begin_src emacs-lisp
(defun alm/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name "~/dotfiles/doomemacs/.doom.d/"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook  #'alm/org-babel-tangle-config)))
#+end_src

** Org Roam

#+begin_src emacs-lisp
(use-package! org-roam
  :custom
  (org-roam-directory "/home/hrothgar32/Documents/Projects/braindump/RoamNotes")
  (org-roam-dailies-directory "./daily")
  (org-roam-capture-templates
    '(("d" "default" plain "%?" :target
    (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed t)
      ("r" "bibliography reference" plain
         (file "~/Documents/Projects/braindump/RoamNotes/templates/noter.org")
         :target
         (file+head "references/${citekey}.org" "#+title: ${title}\n")))
   )
  (org-roam-dailies-capture-templates
        '(("d" "default" entry
        "* %?"
        :target (file+head "%<%Y-%m-%d>.org"
                                "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-complete-everywhere t))
#+end_src

#+begin_src emacs-lisp
(when (daemonp)
        (add-to-list 'org-roam-buffer-postrender-functions (lambda () (org--latex-preview-region (point-min) (point-max))) t)
        (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
        )

#+end_src

#+begin_src emacs-lisp
(defun benmezger/org-roam-export-all ()
  "Re-exports all Org-roam files to Hugo markdown."
  (interactive)
  (dolist (f (org-roam-list-files))
    (with-current-buffer (find-file f)
        (org-hugo-export-wim-to-md)
      )))
#+end_src

#+begin_src emacs-lisp
(require 'find-lisp)
(defun alm/publish (file)
  (with-current-buffer (find-file-noselect file)
    (setq org-hugo-base-dir "/home/hrothgar32/Documents/Projects/braindump")
    (let ((org-id-extra-files (find-lisp-find-files org-roam-directory "\.org$")))
      (org-hugo-export-wim-to-md))))
#+end_src
*** Extract subtree redefine
#+begin_src emacs-lisp
(defun org-roam-extract-subtree ()
  "Convert current subtree at point to a node, and extract it into a new file."
  (interactive)
  (save-excursion
    (org-back-to-heading-or-point-min t)
    (when (bobp) (user-error "Already a top-level node"))
    (org-id-get-create)
    (save-buffer)
    (org-roam-db-update-file)
    (let* ((template-info nil)
           (node (org-roam-node-at-point))
           (template (org-roam-format-template
                      (string-trim (org-capture-fill-template org-roam-extract-new-file-path))
                      (lambda (key default-val)
                        (let ((fn (intern key))
                              (node-fn (intern (concat "org-roam-node-" key)))
                              (ksym (intern (concat ":" key))))
                          (cond
                           ((fboundp fn)
                            (funcall fn node))
                           ((fboundp node-fn)
                            (funcall node-fn node))
                           (t (let ((r (completing-read (format "%s: " key) nil nil nil default-val)))
                                (plist-put template-info ksym r)
                                r)))))))
           (file-path (read-file-name "Extract node to: " org-roam-directory template nil template)))
      (when (file-exists-p file-path)
        (user-error "%s exists. Aborting" file-path))
      (org-cut-subtree)
      (save-buffer)
      (with-current-buffer (find-file-noselect file-path)
        (org-paste-subtree)
        (save-buffer)
        (org-roam-promote-entire-buffer)
        (save-buffer)))))
#+end_src
*** Hacky solution to links displaying in roam-buffer

#+begin_src emacs-lisp
(setq org-fold-core-style 'overlays)
#+end_src

