doomemacs/.doom.d/config.org
* Java Setup

#+begin_src emacs-lisp
(setq lsp-java-autobuild-enabled nil)
(defun lsp-java--completing-read-multiple (message items initial-selection)
    (if (functionp 'ivy-read)
        (let (result)
          (ivy-read message (mapcar #'car items)
                    :action (lambda (c) (setq result (list (cdr (assoc c items)))))
                    :multi-action
                    (lambda (canditates)
                      (setq result (mapcar (lambda (c) (cdr (assoc c items))) canditates))))
          result)
      (let ((deps initial-selection) dep)
        (while (setq dep (cl-rest (lsp--completing-read
                                   (if deps
                                       (format "%s (selected %s): " message (length deps))
                                     (concat message ": "))
                                   items
                                   (-lambda ((name . id))
                                     (if (-contains? deps id)
                                         (concat name " ✓")
                                       name)))))
          (if (-contains? deps dep)
              (setq deps (remove dep deps))
            (cl-pushnew dep deps)))
        deps)))
(map! :map ivy-mode-map "C-p" 'ivy-mark)
(map! :map ivy-mode-map "C-u p" 'ivy-unmark)
#+end_src

* C/C++ setup

#+begin_src emacs-lisp
(require 'dap-cpptools)
#+end_src

* Dired setup
** Core setup

#+begin_src emacs-lisp
(use-package dired-hide-details
  :hook (dired-mode . dired-hide-details-mode))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

** Hide dotfiles

#+begin_src emacs-lisp
  (defun dired-dotfiles-toggle ()
    "Show/hide dot-files"
    (interactive)
    (when (equal major-mode 'dired-mode)
      (if (or (not (boundp 'dired-dotfiles-show-p)) dired-dotfiles-show-p) ; if currently showing
	  (progn
	    (set (make-local-variable 'dired-dotfiles-show-p) nil)
	    (message "h")
	    (dired-mark-files-regexp "^\\\.")
	    (dired-do-kill-lines))
	(progn (revert-buffer) ; otherwise just revert to re-show
	       (set (make-local-variable 'dired-dotfiles-show-p) t)))))
#+end_src

* Agenda Setup
** Basic agenda variables

#+begin_src emacs-lisp
(setq org-todo-keywords-for-agenda
      (quote ((sequence "TODO(t)" "NEXT(p)" "WAIT(w)" "CANCELLED" "DONE(r)")
              (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)"))))

(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(p)" "WAIT(w)" "CANCELLED" "DONE(r)")
              (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)"))))
(setq org-agenda-files '("/home/hrothgar32/Dropbox/Org/agenda.org" "/home/hrothgar32/Dropbox/Org/agenda/"))

(setq org-capture-templates
      (quote
            (("t" "Personal todo" entry
            (file "~/Dropbox/Org/agenda/personal.org")
            "* TODO %?\nSCHEDULED: <%(org-read-date)>")
             ("a" "Assignment" entry
            (file+headline "~/Dropbox/Org/agenda/egyetem.org" "Assignments")
            "* TODO [#B] %? :@egyetem:@assignment: \nDEADLINE: <%(org-read-date)>")
            ("e" "Exam" entry
            (file+headline "~/Dropbox/Org/agenda/egyetem.org" "Vizsgák")
            "* TODO [#A] %? :@egyetem:@vizsga: \nSCHEDULED: <%(org-read-date)>")
            ("i" "inbox" entry
            (file "~/Dropbox/Org/agenda/inbox.org")
            "* TODO %?\nSCHEDULED: <%(org-read-date)>"))
       ))
#+end_src

* LaTeX setup

#+begin_src emacs-lisp
;; jaja
(setq +latex-viewers '(zathura))

(map! :map cdlatex-mode-map
    :i "TAB" #'cdlatex-tab)

(add-hook 'LaTeX-mode-hook (lambda ()
                             (add-hook 'after-save-hook (lambda () (TeX-command "LatexMk" #'TeX-master-file)) nil t)))

(map!
  :map LaTeX-mode-map
  :nv
  "z a" 'outline-toggle-children)
#+end_src

* BibTeX setup

#+begin_src emacs-lisp
(setq! bibtex-completion-bibliography '("/home/hrothgar32/Documents/allamvizsga/allamvizsga.bib"))
(setq! bibtex-completion-pdf-field "File")
(setq! org-cite-global-bibliography '("/home/hrothgar32/Documents/allamvizsga/allamvizsga.bib"))
(setq org-cite-csl-styles-dir "~/Zotero/styles")
(use-package! org-roam-bibtex
  :after org-roam
  :custom
  (orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-keyword t
      orb-attached-file-extensions '("pdf"))
  (orb-roam-ref-format 'org-cite)
  :config
  (org-roam-bibtex-mode))

(org-cite-register-processor 'my-bibtex-org-cite-follow
  :follow (lambda (_ _) (ivy-bibtex)))
(setq org-cite-follow-processor 'my-bibtex-org-cite-follow)

#+end_src

* Org noter setup

#+begin_src emacs-lisp
(setq org-noter-notes-search-path (list (concat org-roam-directory "/references")))
(setq org-noter-always-create-frame t)
#+end_src

#+RESULTS:
: t

* Email setup
** Setting up acccounts

#+begin_src emacs-lisp
(set-email-account! "gmail"
  '((mu4e-sent-folder       . "/gmail/[Gmail]/Sent Mail")
    (mu4e-drafts-folder     . "/gmail/[Gmail]/Drafts")
    (mu4e-trash-folder      . "/gmail/[Gmail]/Trash")
    (smtpmail-smtp-user     . "zold.almos@gmail.com")
    (user-mail-address     .  "zold.almos@gmail.com")
    (mu4e-compose-signature . "---\n Almos Zediu")
    )
  t)
(set-email-account! "sasmail"
  '((mu4e-sent-folder       . "/gmail2/[Gmail]/Sent Mail")
    (mu4e-drafts-folder     . "/gmail2/[Gmail]/Drafts")
    (mu4e-trash-folder      . "/gmail2/[Gmail]/Trash")
    (smtpmail-smtp-user     . "sasokcsapat@gmail.com")
    (user-mail-address     .  "sasokcsapat@gmail.com")
    (mu4e-compose-signature . "---\n Almos Zediu")
    )
  t)
(set-email-account! "ubboutlook"
  '((mu4e-sent-folder       . "/ubboutlook/Sent Items")
    (mu4e-drafts-folder     . "/ubboutlook/Drafts")
    (mu4e-trash-folder      . "/ubboutlook/Deleted Items")
    (smtpmail-smtp-user     . "almos.zediu@stud.ubbcluj.ro")
    (user-mail-address      . "almos.zediu@stud.ubbcluj.ro")
    (mu4e-compose-signature . "---\n Almos Zediu")
    )
  t)
#+end_src


#+begin_src emacs-lisp
;; (setq +mu4e-gmail-accounts '(("zold.almos@gmail.com" . "zold.almos")))
#+end_src

** Contexts
#+begin_src emacs-lisp
(setq mu4e-context-policy 'ask-if-none
      mu4e-compose-context-policy 'always-ask)
#+end_src

#+begin_src emacs-lisp
(after! mu4e
  (setq sendmail-program (executable-find "msmtp")
        send-mail-function #'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function #'message-send-mail-with-sendmail))
#+end_src
* Dashboard setup

#+begin_src emacs-lisp
(use-package! dashboard
  :config
  (dashboard-setup-startup-hook))

(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
(setq dashboard-center-content t)
(setq dashboard-set-heading-icons t)
(setq dashboard-set-file-icons t)
#+end_src
* PlantUML

#+begin_src emacs-lisp
(setq org-plantuml-jar-path (expand-file-name "/usr/share/java/plantuml/plantuml.jar"))
(add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
(org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))
#+end_src
* Bison mode

#+begin_src emacs-lisp
(require 'bison-mode)
#+end_src

